package Lesson1;


//Реализуйте метод checkArray(Integer[] arr), принимающий в качестве аргумента целочисленный одномерный массив.
// Метод должен пройтись по каждому элементу и проверить что он не равен null. Реализуйте следующую логику:
// 1. Если в какой-то ячейке встретился null, то необходимо “оповестить” об этом пользователя
// 2. Если null’ы встретились в нескольких ячейках, то идеально было бы все их “подсветить”



public class Task4 {
    public static void main(String[] args) {

    }
}
